
{
  "projects": {
    "engie": {
      "title": "Outils de Tarification Énergie et Migration Technique (Opteam & Explore)",
      "description": "Ingénieur Full-Stack, j'ai participé à la conception et au développement des applications Opteam et Explore pour la tarification de l'énergie. J'ai également contribué à la migration vers un nouveau socle technique afin d'améliorer les performances et la maintenabilité, tout en aidant à la formation des nouvelles recrues et en mettant en place des améliorations architecturales."
    },
    "obs": {
      "title": "Développement d'Abacus : Outil de Tarification pour le Portefeuille de Produits et Services",
      "description": "En tant qu'ingénieur Full-Stack, j'ai participé au développement d'Abacus, un outil de tarification B2B pour Orange Business Services. J'ai conçu de nouvelles fonctionnalités, contribué à la migration du front-end et du back-end, et amélioré la résilience de l'application. J'ai également mis en place un système de notifications en temps réel pour suivre la progression des opérations asynchrones déclenchées via un Event Bus, offrant ainsi une meilleure visibilité aux utilisateurs sur l'état d'avancement des processus. J'ai collaboré avec des équipes internationales sur divers aspects techniques et fonctionnels."
    },
    "axilum": {
      "title": "Développement d'un Système de Mise à Jour Automatisée pour Robots Médicaux",
      "description": "En tant qu'ingénieur Full-Stack chez Axilum Robotics, j'ai conçu et développé un système de mise à jour automatisée pour leurs robots médicaux. J'ai mis en place une application web hébergée sur Azure permettant de détecter les robots connectés, de préparer les mises à jour et de gérer leur installation à distance. J'ai également développé une application WinForms côté client (robot) pour récupérer et installer les mises à jour, que ce soit en ligne ou hors ligne. Un service web basé sur SOAP a été créé pour assurer la communication entre le serveur et les robots. J'ai également assuré les tests fonctionnels et mis en place un environnement de développement avec un réseau de test."
    },
    "gunnebo": {
      "title": "Intégration de Communication NFC/QR Code sur Automate Bancaire",
      "description": "En tant qu'ingénieur R&D en systèmes embarqués, j'ai conçu et développé des bibliothèques en C++ pour interfacer des lecteurs de code-barres RS232 avec une carte embarquée fonctionnant sous Windows CE. J'ai également créé une application mobile multiplateforme permettant une communication fluide entre un smartphone et un automate bancaire via NFC et QR code. Ce projet incluait le prototypage, les tests fonctionnels ainsi que la documentation complète du système. J'ai aussi assuré l'interface technique entre Gunnebo et ses fournisseurs pour garantir l'intégration fluide de leurs technologies."
    },
    "portfolio": {
      "title": "Portfolio Personnel : Projets et Expériences Professionnelles",
      "description": "Ce portfolio présente une sélection de mes projets et expériences."
    },
    "salaires": {
      "title": "Développement du frontend pour salaires.dev",
      "description": "Actuellement en train de concevoir et développer un frontend interactif pour la plateforme salaires.dev en utilisant Vue.js, afin d'améliorer l'expérience utilisateur et la navigation."
    }
  },
  "common": {
    "repository": "Dépôt",
    "demo": "Démo en Direct",
    "confidentialMessage": "Ce projet est confidentiel et l'accès au dépôt et à la démo en direct est restreint.",
    "inProgressMessage": "Ce projet est actuellement en cours. Le dépôt et la démo en direct ne sont pas encore disponibles.",
    "readMore": "Lire la suite"
  },
  "contact": {
    "heading": "Contactez-moi",
    "name": "Nom",
    "attachmentFile": "Pièce jointe (optionnelle)",
    "browse": "Parcourir...",
    "submitButton": "Envoyer le Message",
    "emailSentSuccess": "E-mail envoyé avec succès !",
    "emailSentError": "Échec de l'envoi de l'e-mail. Veuillez réessayer.",
    "maxMessagesReached": "Vous avez atteint le nombre maximum de messages à envoyer pour aujourd'hui. Veuillez réessayer demain."
  },
  "home": {
    "heading": "Solutions full stack adaptées à vos besoins métiers",
    "description": "Je suis développeur Full Stack spécialisé en .NET, Vue.js et Azure. Fort de 7 ans d’expérience dans divers secteurs, je me concentre sur la création d'applications performantes et évolutives.",
    "description_hook":"Discutons de votre prochain projet.",
    "contactButton": "Me Contacter",
    "downloadResumeButton": "Télécharger le CV",
    "seeProjectsButton": "Voir mes Projets",
    "availableForWork": "Disponible pour des missions freelance ou des postes en CDI.",
    "currentLocation": "Localisation Actuelle : Annecy, GMT+2",
    "developerMode": "Mode Développeur"
  },
  "errors": 
  {
    "resumeDownloadFailed": "Aïe, une erreur ! Essayez encore ou passez voir mon LinkedIn !"
  }
}
